Repository: GrahamByrnes/DT-lite
Catalog: doc/usermanual/po/*.po
Languages: cs, sv

source: The owner of the Darktable project is Johannes Hanika. Main developers are Johannes Hanika and Henrik Andersson. Darktable is a free software: you can redistribute it and/or modify it under the terms of the GNU General Public License as published by the Free Software Foundation, either version 3 of the License, or (at your option) any later version.
cs: Vlastník projektu Darktable je Johannes Hanika. Hlavní vývojáři jsou Johannes Hanika a Henrik Andersson. Darktable je svobodný software: můžete jej dále šířit a/nebo upravovat pod podmínkami licence GNU General Public License, tak jak jí publikovala Free Software Foundation, verze 3 této licence nebo její v novější variantě.

source: Darktable is distributed in the hope that it will be useful, but WITHOUT ANY WARRANTY; without even the implied warranty of MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE. See the GNU General Public License for more details.
cs: Darktable je distribuován v naději, že to bude užitečné, ale BEZ JAKÉKOLIV ZÁRUKY;.. dokonce i bez záruky PRODEJNOSTI nebo VHODNOSTI PRO KONKRÉTNÍ ÚČEL. Viz GNU General Public License pro více informací

source: You should have received a copy of the GNU General Public License along with Darktable. If not, see <emphasis> http://www.gnu.org/licenses/</emphasis>.
cs: Kopie GNU General Public License by měla být dodána spolu s Darktable. Pokud ne, navštivte <emphasis> http://www.gnu.org/licenses/</emphasis>.

source: The present user manual is under license <emphasis>cc by-nc-sa </emphasis>, meaning <emphasis>Attribution Non-Commercial Share Alike </emphasis>. You can visit <emphasis>http://creativecommons.org/about/licenses/</emphasis> to get more information.
cs: Současný manuál je licencován pod <emphasis>cc by-nc-sa </emphasis>, což znamená <emphasis>Attribution Non-Commercial Share Alike </emphasis>. Můžete navštívit <emphasis>http://creativecommons.org/about/licenses/</emphasis> pro získání více informací.

source: Preface to darktable
cs: Předmula k darktable

source: <indexterm significance="normal"><primary>Darktable</primary></indexterm><indexterm significance="normal"><primary>Preface</primary></indexterm> The current user manual is a draft issue. It is at an early stage of writing. User manual version and applicable Darktable version are listed below: <informaltable frame="none"><tgroup cols="3" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry/><entry>version</entry><entry>date</entry></row><row><entry>user manual</entry><entry/><entry>27/10/10</entry></row><row><entry>Darktable</entry><entry>darktable 0.6+429~g6de9bfb</entry><entry>27/10/10</entry></row></tbody></tgroup></informaltable>
cs: <indexterm significance="normal"><primary>Darktable</primary></indexterm><indexterm significance="normal"><primary>Preface</primary></indexterm> Současný manuál je pouze draft. It is at an early stage of writing. Verze uživatelského manuálu a použitého Darktable je vypsána pod odstavcem: <informaltable frame="none"><tgroup cols="3" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry/><entry>version</entry><entry>date</entry></row><row><entry>Uživatelský manuál</entry><entry/><entry>27/10/10</entry></row><row><entry>Darktable</entry><entry>darktable 0.6+429~g6de9bfb</entry><entry>27/10/10</entry></row></tbody></tgroup></informaltable>

source: Please note that every key accelerators given in this manual is only applicable on english keyboards layout. The key accelerators are not linked to the actual letter printed on it, but only to its position on the keyboard. For example, the <emphasis>z</emphasis> allowing a full-screen view on english keyboards, becomes <emphasis>w</emphasis> on french keyboard.
cs: Prosím vezměte na vědomí, že každá klávesová zkratek uvedenách v této příručce je použitelná pouze na anglické klávesnici rozložení. Klávesové zkratky nejsou vázány na aktuální popis vytištěn na to, ale pouze na jeho pozici na klávesnici. Například, <emphasis>z</emphasis> umožňuje celo obrazový pohled na anglické klávesnici, ale <emphasis>w</ emphasis> na francouzské klávesnici.

source: overview
cs: přehled
sv: översikt

source: application
cs: aplikace
sv: program

source: Overview
cs: Přehled
sv: Översikt

source: Darktable is an application to manage and develop your digital images.
cs: Darktable je aplikace pro správu a vyvolávání vašich digitálních obrázků.

source: It is fully non-destructive and works on a 32 bit floating point format per channel. Most of the actions on the pixelpipe are done in CIELab.
cs: Je plně nedestruktivní a pracuje v 32bitovém formátu s plovoucí řádovou čárkou na kanál. Nejvíce akcí nad obrazovými daty je vykonáno barevném prostoru CIELab.

source: Preferences
cs: Předvolby

source: A recently introduced button located at the upper panel allows you to define various parameters.
cs: Nově představené tlačítko nacházející se v horním panelu vám dovolí nastavit různé parametry.

source: User interface
cs: Uživatelské prostředí

source: This section describes the layout of the user interface. You can change Darktable contrast by using <placeholder-1/> and <placeholder-2/>.
cs: Tato sekce popisuje rozvržení uživatelského prostředí. Můžete měnit kontrast Darktable použitím <placeholder-1/> and <placeholder-2/>.

source: Views
cs: Pohledy
sv: Vyer

source: Lighttable
cs: Prosvětlovací stůl
sv: Ljusbord

source: The lighttable view is where you manage your images and filmrolls; it's in that view that you rate, add tags, add colorlabels, export images among other actions.
cs: Režim prosvětlovacího stolu je kde spravujete své fotografie a filmové role, je to také pohled kde hodnotíte, přidáváte tagy a barevné značky a exportujte obrázky mimo dalších akcí.

source: Darkroom
cs: Fotokomora
sv: Mörkerrun

source: In the darkroom view you develop a specific image using the available modules.
cs: V režimu fotokomory pracujte přímo s obrazem vyvolávané fotografie při použití dostupných modulů.

source: Tethering
cs: Fotografování fotoaparátem

source: This view is where you do camera tethering.
cs: V tomto režimu můžete fotografovat fotoaparátem
sv: Denna arbetsytan används för att fånga bilder från ansluten kameran remote.

source: Filmstrip
cs: Filmový pás
sv: Bildband

source: The filmstrip shows the same images as lighttable with respect to filter and sort orders and are turned on/off with key accelerator <emphasis>ctrl-f</emphasis>. You can navigate along the filmstrip by wheel scrolling. The filmstrip allows you to interact with images when you are not in lighttable mode. For example you can, while being in darkroom mode and developing an image, switch to another image to develop by double clicking the thumb in the filmstrip.
cs: Filmového pásu ukazuje stejný fotografie jako prosvětlovací stůl s ohledem na filtr a řazení pokud jsou zapnuty a vypnuty klávesovou zkratkou <emphasis> ctrl-f </emphasis>.Po páse se můžete pohybovat otáčením kolečka. Filmového pásu umožňuje pracovat s obrázky, když nejste v když režimu prosvětlovacího stolu. Například můžete, i když je v fotokomoře režimu a vyvíjením fotografie, přejít na další snímek dvojitým kliknutím na náhled ve filmovém pásu.

source: Darktable workflow
cs: Fotokomora postup práce
sv: Darktable arbetsflöde

source: lighttable
cs: prosvětlovací stůl
sv: ljusbord

source: view
cs: pohled
sv: vy

source: The lighttable is where you manage all your images, ratings, exporting and much more...
cs: Prosvětlovací stůl je místo, kde spravujete své fotografie, hodnotíte, exportujte a mnoho dalšího...
sv: Ljusbordvyn är den vyn som du hanterar alla dina bilder såsom betyg, exportering och mycket mer...

source: The lighttable view
cs: Režim - prosvětlovací stůl
sv: Ljusbordsvy

source: In this centerview, your images are shown as thumbs; each thumb has a frame and while mouse is over an image, the information of rating, colorlabels and if image is altered in darkroom <inlinegraphic fileref="images/lighttable_thumb_icon_altered.png" scalefit="1" width="3mm"/> is shown. Also when mouse hovers over an image frame the specific image metadata is shown in the metadata panel.
cs: V tomto hlavním pohledu, se vaše obrázky zobrazí jako náhledy, každý náhled má rám a pokud najedete myší nad obrázek, zobrazí se informace o hodnocení, barevné značky a je-li přepnuto do v fotokomory <inlinegraphic fileref="images/lighttable_thumb_icon_altered.png" scalefit ="1" width ="3mm"/> obrázek se zobrazí. I když myš se vznáší nad obrázku rám specifický obraz metadata je uvedeno v metadatech panelu.

source: In order to locate where you are in your collection, you have read-only sliders at the extreme border of the window : left/right for your vertical position in the collection, top/bottom (when in zoomable lighttable mode, see below) for your zoom level.
cs: Aby bylo možné zjistit, kde se nacházíte ve své sbírce, na okraji okna se nachází posuvníky: levé/pravé pro svislou polohu ve sbírce, nahoře/dole (jste-li v přiblíženém prosvětlovacím stole, viz níže ) pro úroveň přiblížení.

source: While mouse is over an image frame, you have additional actions accessed from keyboard to apply on image; here follows a table of key accelerators and assigned actions. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>set the rating of the image; if an image has 1 star and you hit the <emphasis>1</emphasis> key, the image will be unrated </entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>set a color label for the image</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>copy the historystack of the image</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>apply the copied historystack on the image</entry></row><row><entry><emphasis>e</emphasis></entry><entry>open the image in darkroom view for developing</entry></row><row><entry><emphasis>z</emphasis></entry><entry>show a fullscreen view of the image</entry></row></tbody></tgroup></informaltable>
cs: Dokud je myš na obrázku, jsou další akce, které se aplikují na obrázek přístupné z klávesnice; Zde následuje tabulka zkratek a přiřazené akce <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>nastavit hodnocení; pokud má fotografie 1 hvězdu při stisku <emphasis>1</emphasis> dojde k přiřazení nulévého hodnocení </entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>nastavení barevné značky k fotografii</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>zkopíruje štos historie z fotografie</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>aplikuje zkoprovaný štos historie na fotografii</entry></row><row><entry><emphasis>e</emphasis></entry><entry>otevře fotografii v režimu fotokomora</entry></row><row><entry><emphasis>z</emphasis></entry><entry>zobrazí fotografii přes celou obrazovku</entry></row></tbody></tgroup></informaltable>

source: At the bottom you have an option to choose between zoomable lighttable view or filemanger view of the thumbnails.
cs: V dolní části máte možnost vybrat si mezi přivažovatelným prosvětlovacím stolem nebo zobrazením náhledů ve formě správce souborů.

source: Using the zoomable lighttable view, scroll with your mouse wheel to zoom in and out. The <emphasis>hold left-click</emphasis> allows you to navigate through your collection.
cs: Použití přivažovatelným prosvětlovacím stolem, přejděte s kolečkem myši pro přiblížení a oddálení. <emphasis> Podržte levé-tlačítko myši </emphasis> a to vám umožní posouvat ve sbírce.

source: While in filemanager, by pressing <emphasis>w/s</emphasis> you can scroll (not select) up and down through your collection. In zoomable lighttable <emphasis>a/d/w/s</emphasis> allow you to move left/right/up/down through your collection.
cs: V souborovém manažeru, stisknutím <emphasis>w/s</emphasis> můžete rolovat (ne výběr) nahoru a dolů přes sbírky. V přivažovatelným prosvětlovacím stolem <emphasis>a/d/w/s</emphasis> vám umožní pohyb vlevo/vpravo/nahoru/dolů ve vaší sbírce.

source: darkroom
cs: fotokomora
sv: mörkerrum

source: The darkroom view is where you develop your image...
cs: Fotokomora je režim kde vyvíjíte vaše fotografie...
sv: Mörkerrumsvyn är den vy du arbeterar med din bild...

source: The darkroom view
cs: Režim - fotokomora
sv: Mörkerrumsvyn

source: In darkroom you are in develop mode for the specific image; here you have a lot of tools (named module) to develop you image.
cs: Ve režimu fotokomora jste v vyvíjíte konkrétní obrázek, máte zde mnoho nástrojů (s názvem modulu) úpravu fotografií.

source: On the left side you have the navigation, snapshots and history panels, each of them being described below; in the right panel you can see the histogram and then a list of available modules to use when working with your image. At the bottom of the right panel you can enable/disable view of individual modules.
cs: Na levé straně se nachází navigaci, snímky a panel s historií, každá část je popsána níže; v pravém panelu můžete vidět histogram a pak seznam dostupných modulů pro použití při práci s fotografií. V dolní části pravého panelu si můžete zapnout/vypnout zobrazení jednotlivých modulů.

source: Since darktable 0.6.1, modules are grouped into four groups: basic, color, correct, effect. However, you can view all modules by selecting no group.
cs: Od darktable 0.6.1, jsou moduly rozděleny do čtyř skupin: základní, barva, opravit, efekty. Nicméně, můžete zobrazit všechny moduly pokud žádná skupina není vybrána.

source: You can use middle-click to zoom 1:1. A double middle-click takes you to 2:1.
cs: Můžete použít prostřední tlačítko pro přiblížení 1:1. Dvojklikem na prostřední tlačítko přiblížíte na 2:1.

source: Panels
cs: Panely
sv: Paneler

source: Snapshots
cs: Snímky
sv: Ögonblicksbild

source: You can take a snapshot of what is displayed in the center view; this snapshot can then be selected and is overlayed in the current center view to help you with a side by side comparasion (left: snapshot, right: active) when you are tuning parameters of a module. In the active view, history remains usable in order to compare with the snapshot.
cs: Můžete pořídit snímek který se zobrazí ve středu; tento snímek může být vybrán a poté nastaven na překrytí aktuálního středu zobrazení, kvůli porovnání dvou snímků (vlevo: snímek, vpravo: aktivní), když ladíte parametry modulů. V aktivním pohledu, historie zůstává za účelem srovnání se snímkem.

source: Modules
cs: Moduly
sv: Moduler

source: Each correction, enhancement or effect is implemented as modules, and this section includes documentation of each module and its specific parameters. A module consists of an expander bar <inlinegraphic fileref="images/darkroom_module_expander.png"/> where the <inlinegraphic fileref="images/darkroom_module_icon_enable.png"/> icon is used to turn then module on or off, then there are a title of the module press this to expand the module to see the parameters user interface. <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> icon is the preset icon to access the available presets stored for the module or to create new ones. The <inlinegraphic fileref="images/darkroom_module_icon_reset.png"/> icon is used to reset the module parameters to their default values.
cs: Všechny úpravy, vylepšení nebo efekty jsou implementovány jako moduly, a tato část dokumentuje každý modul a jeho specifické parametry. A module consists of an expander bar <inlinegraphic fileref="images/darkroom_module_expander.png"/> where the <inlinegraphic fileref="images/darkroom_module_icon_enable.png"/> icon is used to turn then module on or off, then there are a title of the module press this to expand the module to see the parameters user interface. <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> icon is the preset icon to access the available presets stored for the module or to create new ones. The <inlinegraphic fileref="images/darkroom_module_icon_reset.png"/> icon is used to reset the module parameters to their default values.

source: Presets
cs: Předvolby
sv: Förinställningar

source: Presets are stored configurations for the module parameters both internal and user-defined is available through clicking the <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> icon and a list of available presets are shown for your choice, the activated preset is in bold text.
cs: Předvolby jsou uložené konfigurace pro parametry modulů jak interní tak uživatelsky definované a jsou přístupné zkrze kliknutní na <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> ikonu a zobrazí se seznam dostupných předvoleb pro vaš výběr, aktivovaná volba je tučně.

source: The preset system does also support automatic preset selection based on image data such as focal length, iso, camera model and much more fields.
cs: Výchozí předvolby systému podporují automatické přednastavený výběr na základě dat, jako je ohnisková vzdálenost, ISO, model fotoaparátu a dalších.

source: Creating a new preset
cs: Vytvoření nové předvolby
sv: Skapa en ny förinställning

source: Configure the specific module of choice as you like then you click the <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> icon and select store new preset menu choice. Following dialog will be shown to configure the preset:
cs: Přizpůsobte zvláštní volby modulu, jak budete chtít poté klikněte na <inlinegraphic fileref="images/darkroom_module_icon_presets.png"/> ikonu a vyberte uložit novou předvolbu výběrem z menu. Následující dialogové okno se zobrazí pro nastavení předvoleb:

source: The first two fields are used for setting a name and a description of the preset.
cs: První dvě pole jsou určena pro jméno předvolby a její popis.

source: In the example i have also checked the auto apply option which brings up the image selection fields where you can define a filter that is used to decide if the preset should be applied the image or not. The example dialog above does set up following rules, if lens name matches and aperture is &gt;= 8 and focal length is in range 24 - 35mm the preset will be automatically applied, it will also only show in the preset list if the image does match this rule.
cs: V tomto příkladu jsem se také použil auto použití, která přináší do oblasti obrazu výběr pole, kde si můžete definovat filtr, který se používá k rozhodnutí, zda použít předvolby na obraz, nebo ne. V příkladu výše se dialogové okno nastavení těchto pravidel, pokud je objektiv jméno zápasů a clony je &g> = 8 a ohnisková vzdálenost je v rozmezí 24 až 35 mm nastavený bude automaticky použita, bude také zobrazovat pouze v přednastaveného seznamu v případě, že obraz se utkání toto pravidlo.

source: The data used is the EXIF information so if you want a preset to be applied to all images from a specific camera, then leave all fields at default values, lookup model string in metadata panel and enter it into the model field.
cs: Data použitá jsou z EXIF informací, pokud tedy chcete předvolbu aplkovat na všechny snímky ze vybraného fotoaparátu, zanechte všechny buňky na default hodnotách, najděte řetězec v panelu metadat a zadejte ho do pole model fotoaparátu.

source: Crop and rotate
cs: Ořez a otočení
sv: Beskär och rotera

source: This module is used to crop, rotate and correct perspective of your image. It also includes many helpful guidelines that assist you using the tools.
cs: Tento modul se používá pro ořez, otočení a úpravu perspektivy vašeho snímku. V modulu jsou také přístupné vodící čáry, které asistují při používání modulu

source: The velvia module enhances the saturation in the image; it increases saturation on lower saturated pixels more than on high saturated pixels.
cs: Velvia modul vylepšuje sytost snímku; zvyšuje sytost na podsycených pixelů více než na přesycených částech.

source: Usage
cs: Použití
sv: Användning

source: Saturation
cs: Sytost
sv: Mättnad

source: This slider controls the strength of saturation for the effect.
cs: Tento posuvník ovládá sílu sytosti barev pro daný efekt

source: Vibrance
cs: Živost

source: Mid-tones bias
cs: Vliv středních tónů

source: This slider controls saturation preservation in mid-tones. It is expressed as the lightness repartition between mid-tones and shadows/highlights. The greater the first number, the stronger the effect.
cs: Tento posuvník upravuje zachovávání sytosti v středních tónech. Je vyjádřena jako rozdělení jasu mezi střední hodnoty a stíny/světla. Čím větší je první číslo, tím silnější je účinek efektu.

source: Splittoning
cs: Rozdělení tónů
sv: Färgdelning

source: Original splittoning method creates a two color linear toning effect where the shadows and highlights are represented by two different colors. In the example image below you can see an original black and white image and one where a splittoning effect are applied with blue in shadows and yellow-ish color in highlights.
cs: Původní metoda pro rozdělení tónů vytvoří efekt dvou barevného lineárního tónování, kde jsou stíny a světla a vyjádřeny dvěma různými barvami. V příkladu na obrázku níže můžete vidět originální černý/bílý snímek a jeden, kde je aplikován efekt rozdělení tónů s modrou ve stínech a žluté barvy světel.
sv: Standard färgdelningsmetod skapa en 2 färgers linjär färgtoningseffekt där skuggor och högdagrar representeras av två olika färger. I bildexemplet till höger ser du ett orginal svartvit bild och ett med färgdelning där färgen blå används för skuggor och gulliknande frö högdagrar.

source: The splittoning module does not convert image to black and white and works extensible nice on color images, soo if you want to do traditional splittoning, use the monochrome module to make the image black and white before playing around with splittoning effect.
cs: Modul rozdělení tónů nepřevádí snímek na černo-bílý a pracuje pěkné na barevné fotografiích, takže pokud chcete udělat tradiční rozdělení tónů, použijte monochromatický modul pro černo-bílou fotografii než si budete hrát s tímto efektem.
sv: Modulen färgdelning konverterar inte din bild till svartvit och fungerar utmärkt på färgbilder, så om du vill göra traditionell färgdelning använd modulen monokrom för att göra bilden svartvit innan du testar färgdelnings effekten.

source: Shadows and Highlights color
cs: Barvy stínů a světel

source: These controls are used to set the color of the splittoning effect, you select the desire color and saturation for both shadows and highlights, you can also click the color preview box too bring up a common color picker dialog.
cs: Tyto ovládací prvky se používají k nastavení barvy efekt rozdělení tónů, vyberete barvu podle přání a sytost barevy pro stíny a světla, můžete také klepnout na pole barvy náhledu k vyvolání dialogového okno pro výběr barvy
sv: Dessa kontroller används för att välja färgton av färgedelningseffekten, du väljer specific färg och färgmättnad för både skuggor och högdagrar, du kan också den lilla färgboxen för att visa en standard dialog färgval.

source: Balance
cs: Vyvážení
sv: Balans

source: The balance is presented as an ratio bar and default value is 50/50 which means that 50% of lightness range in image are used for shadows toning and the other 50% for highlights toning.
cs: Vyvážení je prezentováno jako poměr a výchozí hodnota je 50/50, což znamená, že 50% světelného rozsahu v obrázku je použito pro stíny a dalších 50% pro tónování světel.
sv: Balans är presenterad som ett förhållande värde där standardvärdet är 50/50 vilket betyder att 50% av ljusheten i bilden används för toning av skuggor och den andara 50% för högdagrar.

source: Compression
cs: Stlačení
sv: Komprimering
