Repository: GrahamByrnes/DT-lite
Catalog: doc/usermanual/po/*.po
Languages: cs, sv

source: Compression is a percentage of total lightness range that not is affected by color toning, default value is set to 33% which not is the default behaviour of a original splittoning which would be 0% compression. The choice of 33% as default is to invite you exprimenting with these parameters and how it extends the original splittoning method...
cs: Stlačení je procento celkového světelného rozsahu, tak že není je ovlivněn barevný tón, výchozí hodnota je nastavena na 33%, což už je standardní chování původního rozdělení tónů, která by byla 0% stlačení. Výběr 33% jako výchozí je spíše pozvánka pro exprimentování s těmito parametry a jak se rozšiřuje původní metodou rozdělení tónů ...
sv: Komprimering är ett procental av total ljushetsomfånget som inte påverkas av färgtoning, standardvärde är satt till 33% vilket inte är ett standard beteende av ett orginal färgdelningsfilter vilket skulle vara 0% kompremering. Valet av 33% som standard finns för att bjuda in till exprement.

source: Examples
cs: Příklady
sv: Exempel

source: Procedure
cs: Postup
sv: Procedur

source: This procedure uses tonecurve, channelmixer and splittoning modules.
cs: Tento postup využívá moduly pro tónovou křivku, mixér kanálů a rozdělení tonů
sv: Denna procedur använder modulerna nyanstonkurva, kanalmixer och färgdelning.

source: Image preparation
cs: Příprava fotografie
sv: Förberedning av bild

source: Prepare the image for the cross process steps by adjusting the base settings such as exposure,whitebalance etc. for a correctly looking image.
cs: Připravte obrázek pro křížové-zpracování/prokládání tím, že nastavíte základní nastavení, jako je expozice,vyvážení bílé atd. správně vypadající obraz
sv: Förbered bilden för detta exempel genom att justera basinställningar som exponering, svärta, vitbalans etc. för att få ett bra underlag för effekten.

source: Boost contrast
cs: Zesílit kontrast
sv: Öka kontrasten

source: Select the medium contrast curve preset for tonecurve module to boost the overall contrast in the image. You later might get back here to tune the curve for better result.
cs: Vyberte střední kontrast křivky předvolby pro modul tonové křivky pro zvýšení celkového kontrast v obraze. Později se sem můžete vrátit a vyladit křivku pro lepší výsledek.
sv: Välj förinställning medium kontrast i modulen nyanskurva för att öka kontrasten i bilden. Du vill antagligen gå tillbaka till detta steg senare för att öka eller minska kontrasten i slutresultatet.

source: Color cast
cs: Barevný nádech
sv: Färgning

source: Enable the channel mixer module
cs: Povolte modul mixér kanálů
sv: Aktivera kanalmixermodul

source: Select blue channel and set blue color value to 0.8
cs: Vyberte modrý kanál a nastavte modrou barvu na hodnotu 0,8
sv: Välj blå kanal och ändra blått färgvärde till 0.8

source: Select red channel and change blue color value to 0.1
cs: Vyberte červený kanál a změňte hodnotu modré barvy na 0,1
sv: Välj röd kanal och ändra blå färgvärde till 0.1

source: Select green channel and change blue color value to 0.1
cs: Vyberte zelený kanál a změňte hodnotu modré barvy na 0,1
sv: Välj grön kanal och ändra blå färgvärde till 0.1

source: We use splittoning to add some more coloring to the result for cyan/blue shadows and yellow highlight.
cs: Použijeme rozdělení tónů pro přidání další zbarvení výsledku na azurová/modré stíny a žlutá světla.

source: Enable the splittoning module
cs: Povolte modul rozdělení tonů
sv: Aktivera färgdelningsmodulen

source: Select a cyan/blue tone for shadows and set saturation around 50%
cs: Vyberte azurový/modrý tón pro stíny a nastavte sytost asi na 50%
sv: Välj en turkos/blå färgton för skuggor och ställ in ungefär 50% för mättnad

source: Select a yellow/orange tone for highlights and set saturation around 70%
cs: Vyberte žlutý/oranžový tón pro zvýraznění světel a nastavte sytost asi na 70%
sv: Välj en gul/orange färgton för högdagrar och ställ in ungefär 70% för mättnad

source: Set compression to 10%
cs: Nastavte stlačení na 10%
sv: Ställ 10% komprimering

source: Cyan toned image
cs: Fotografie tónovaná do azurové
sv: Turkos tonad bild

source: Cyan is a nice color touchup for black and white images, this example guides you through how to make this with Darktable and how to control the tone. You can choose any tone of your like for this tutorial...
cs: Cyan je pěkná barva pro retušování/dokončení černobílých obrázků, tento příklad vás provede jak toto udělat v Darktable a jak ovládat tón. Můžete si zvolit tón podle libosti pro tento návod...

source: Black and white
cs: Černá a bílá
sv: Svart och vit

source: Enable the monochrome module to make the image black and white.
cs: Povolit monochromatický modul pro vytváření černo bílé fotografie.
sv: Aktivera modulen monokrom för att göra bilden svartvit.

source: Add color tone
cs: Přidat barevný tón
sv: Lägg till färgton

source: This step selects the basetone of the image using channel mixer, we are going for cyan tone but you can choose the tone of your like here.
cs: V tomto kroku vybereme základní tóny z obrázku pomocí míchání kanálů, my použijeme azurový tón, ale můžete si vybrat tón jaký chcete.
sv: Detta steg väljer grundfärgton för bilden genom att använda kanal mixer, vi kommer att använda turkos ton men du kan välja vilken ton som passar dig här.

source: Select red channel and set red color value to 0.7
cs: Vyberte červeného kanálu a nastavte červenou barvu hodnotu na 0,7
sv: Välj röd kanal och sätt röd färg till värdet 0.7

source: Select green channel and red color value to 0.150
cs: Vyberte zelený kanál a červenou barvu na hodnotě 0,150
sv: Välj grön kanal och sätt röd färg till värdet 0.150

source: Select blue channel and red color value to 0.150
cs: Vyberte modrý kanál a červenou barvu na hodnotě 0,150
sv: Välj blå kanal och sätt röd färg till värdet 0.150

source: As you notice we mix blue and green color to get a cyan tone, we substract 0.3 from red channel and add them to blue and green.
cs: Jak jste zjistili spojením modré a zelené barvy dostaneme modrozelený tón, my odečteme 0,3 z červeného kanálu a přidáním do modré a zelené.
sv: Som du säkert har märkt så har vi blandat blå och grön färg för att få turkos ton, vi tog bort 0.3 från röd kanal och lade till dem på blå och grön.

source: The result of previous step does also add a colorcast on highlight that we actually want to have white for a prettier result. We also wants to add some blue color cast to the shadows to emphasis them.
cs: Výsledek předchozího kroku se také přidat barevné vysílání na zdůraznit, že jsme skutečně chtějí mít bílou pro hezčí výsledek. Také chce přidat nějaký nádech do stínů důraz je
sv: Resultatet av föregående steg föregående steg kommer att skapa en färgning av högdagrar som vi faktiskt vill ta bort för ett snyggare resultat. Vi vill också lägga till lite blå färgton på skuggorna för att betona dem.

source: Select a blue/cyan tone for shadows and set saturation around 50%
cs: Vyberte modrý/modrozelený tón pro stíny a nastavte systost asi na 50%
sv: Välj en blå/turkos färgton för skuggor och välj ett värde run 50% för färgmättnad.

source: Set highlights saturation to zero, to remove saturation on highlights.
cs: Nastavte sytost světel na nulu pro odstranění sytosti barev na světlech
sv: Välj värdet noll för mättning av högdagrar för att färgning i högdagrar.

source: Set compression to zero
cs: Nastavení stlačení na nulu
sv: Ställ in värdet noll som komprimering

source: Use the balance slider to tune the effect, our example uses a balance of 70/30
cs: Použijte posuvník vyvážení k doladění efektu, náš příklad používá vyvážení 70/30

source: Darktable is an application to manage and develop your digital images...
sv: Darktable är ett program för att hantera och arbeta med dina digitala bilder...

source: Userinterface
sv: Användargränsnitt

source: This section describes the layout of the userinterface.
sv: Detta avsnitt beskriver upplägget av användargränsnittet i Darktable.

source: Darktable consist of several views also mentions as modes, for time beeing there is three available views as described in this section, the current view is identified by the label at top of left panel. There are key accelerators to access the different views as descibed in the table below. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>l</emphasis></entry><entry>switches to lighttable view</entry></row><row><entry><emphasis>d</emphasis></entry><entry>switches to darkroom view</entry></row><row><entry><emphasis>t</emphasis></entry><entry>switches to camera tethering view</entry></row></tbody></tgroup></informaltable>
sv: Darktable innehåller olika arbetsytor, för nuvarande tre stycken som beskrivs i detta avsnitt, den aktiva arbetsytan identifieras genom texten överst i högra panelen. Det finns snabbtangenter för att komma åt de olika arbetsytorna som beskriv i tabelleb nedan. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>l</emphasis></entry><entry>byter till ljusbordsvy</entry></row><row><entry><emphasis>d</emphasis></entry><entry>byter till mörkerrumsvy</entry></row><row><entry><emphasis>t</emphasis></entry><entry>byter till kamera tehtering vy</entry></row></tbody></tgroup></informaltable>

source: The lighttable view is where you manage you images and filmrolls, it's in this view you rate, add tags, add colorlabels, export images among other actions.
sv: I ljusbordsvyn hanterar du dina bilder och filmrullar, i denna arbetsyta hanterar du betyg, lägger till taggar och färgmarkeringar, exporterar bilder bland många andra funktioner.

source: In the darkroom view you develop a specific image using the plugins available.
sv: I mörkerrumsvyn så arbetar du med enstaka bilder med hjälp av de plug-ins som finns tillgängliga.

source: Tehtering
sv: Parkopplad kamera

source: The filmstrip views the same images as is viewed in lighttable with respect to filter and sort orders and are turned on/off with key accel ctrl-f. Filmstrip provides some actions to apply on images when you are not in lighttable mode, you can for an example when in darkroom mode and developing an image, switch to another image to develop by doubleclicking the thumb in the filmstrip...
sv: Bildbandet visar samma bilder som visas på ljusbordet dvs. filtrering och sortering är den samma, visningen av bildbandet görs med snabbtangenten ctrl-f. Bildbandet ger dig möjligheter till funktioner på en specifik bild när du inte är i ljusbordsvyn, du kan till exempeli mörkerrummet där du arbeterar med specifik bild, byta till en annan bild att arbeta med genom att dubbelklicka på bilden i bildbandet...

source: The filmstrip does also provide some actions to be performed on image under the mousepointer and here follows a table of available key accelerators for specific actions. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>set the rating of the image, if an image has 1 star and you hit the 1 key the image will be unrated </entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>sets a color label for the image</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>copy the historystack of the image</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>apply the copied historystack onto the image</entry></row></tbody></tgroup></informaltable>
sv: Bildbandet ger dig också tillgång till funktioner på aktiv bild som är under muspekaren och här följer en tabell med de snabbtangenter och tilldelade funktioner som finn tillgängliga. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>välj betyg på bilden, om bilden har 1 stjärna och du trycker tangenten 1 så kommer bilden inte ha något betyg allts.</entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>sätter färgmarkering på bilden</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>kopierar historiken av bilden</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>applicerar den kopierade historiken på bilden</entry></row></tbody></tgroup></informaltable>

source: Ligthtable
sv: Ljusbord

source: In this centerview your images are shown as thumbs, each thumb has a frame and while mouse is over an image, information such as rating and if image are altered in darkroom <inlinegraphic fileref="images/lighttable_thumb_icon_altered.png" scalefit="1" width="3mm"/> is viewed. Also when mouse hovers over an imageframe the specific image metadata is shown in the metadata panel.
sv: I den centrala arbetsytan förhandsvisas dina bilder som miniatyrer, vardera miniatyr har en ram och när muspekaren flyttas över miniatyren så visas information så som betygoch om bilden är bearbetat i mörkerrummet visas ikonen <inlinegraphic fileref="images/lighttable_thumb_icon_altered.png" scalefit="1" width="3mm"/>. När muspekaren är över miniatyren så visas också bildens metadata i panelen metadata.

source: While mouse is over and imageframe you have additional actions accessed from keyboard to apply on image here follows an table of key accelerators and assigned actions. <informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>set the rating of the image, if an image has 1 star and you hit the 1 key the image will be unrated </entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>sets a color label for the image</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>copy the historystack of the image</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>apply the copied historystack on the image</entry></row><row><entry><emphasis>e</emphasis></entry><entry>opens the image in darkroom view for developing</entry></row><row><entry><emphasis>z</emphasis></entry><entry>shows a fullscreen view of the image</entry></row></tbody></tgroup></informaltable>
sv: När muspekaren är över en miniatyr bild så aktiveras miniatyren och då har du tillgång till ett antal funktioner tillgängliga genom snabbtangenter.<informaltable frame="none"><tgroup cols="2" colsep="0" rowsep="0"><colspec colwidth="3cm"/><tbody><row><entry><emphasis>1 - 4</emphasis></entry><entry>välj betyg på bilden, om bilden har 1 stjärna och du trycker tangenten 1 så kommer bilden inte ha något betyg allts.</entry></row><row><entry><emphasis>F1 - F3</emphasis></entry><entry>sätter färgmarkering på bilden</entry></row><row><entry><emphasis>ctrl-c</emphasis></entry><entry>kopierar historiken av bilden</entry></row><row><entry><emphasis>ctrl-v</emphasis></entry><entry>applicerar den kopierade historiken på bilden</entry></row><row><entry><emphasis>e</emphasis></entry><entry>öppnar bilden i mörkerrumsvyn för bearbetning</entry></row><row><entry><emphasis>z</emphasis></entry><entry>visar bilden i fullskärmsläge</entry></row></tbody></tgroup></informaltable>

source: At the bottom you have an option to choose a zoomable lighttable view or a filemanger view of the thumbnails.
sv: I den nedre horisontala panelen kan du välja inzoomningsbart ljusbord eller filhanterar vy av dina miniatyrer.

source: You can take a snapshot of what is displayed in the center view, this snapshot can then be selected and is overlayed in the current center view to help you with a side by side comparasion when you tuning parameters of a module.
sv: Du kan ta en ögonblicksbild av det som visas på skärmen, denna bild kan sedan väljas och placeras då över orginalet i delat format för att kunna göra en sida vid sida jämförelse vid justeringar av reglage på en modul.

source: The velvia module does enhance the saturation in the image, i does increase saturation on lower saturated pixeks more than high satured pixels.
sv: Module Velvia förbättrar färgmättnaden i bilden genom att öka färgitensiteten mer på pixlar med låg färgitentistet än pixlar med hög färgitensitet.

source: Darktable splittoning plugin has more parameters that impacts on the default above behavior, we have balance which offsets the 50% gray level in image and compression that does compress toning in the shadows and highlights which leaves a gap which are untouched by the effect. Read more and see examples of these additional parameters to splittoning module in Parameters section.
sv: Darktable färgdelningsmodul har mer reglage som påverkar standard beteende, vi har balans reglaget som påverkar delnings positionen och komprimeringsreglaget som komprimerar färgtoningen i skuggor och högdagrar vilket lämnar ett gap som inte påverkas av effekten. Läs mer om och se exempel av dessa parameterar i sektionen användning.

source: Shadows and Hilights color
sv: Skuggor och högdagrar

source: Cross-processing
sv: Korsbearbetning

source: Cross-processing is a analog processing technique where slide film (E6) is processed in chemicals used for processing print film (C41). The resulting images get skewed colors usually a cyan hue and increased contrast and saturation.
sv: Korsbearbetning är en analog bearbetningsteknik där diafilm (E6) bearbetades i kemikalier som används för film (C41). Resultatet blev bilder med skeva färger, oftast turkos/grön/gul, och ökad kontrast och färgmättnad.

source: The standard way for doing digital cross-processing is to use a channel curve tool but Darktable lacks this tool for the moment and another way to accomodiate the effect is used.
sv: Det vanligaste tillvägagångsättet för att digitalt skapa denna effekt är att använda ett kurvverktyg per färgkanal men då Darktable saknar detta verktyg för tillfället så används ett annat tillvägagångsätt.

source: This step does change the colorcast as the base for the effect using the channel mixer. You might later get back to this and finetune the colorcast of the final result.
sv: Detta steg förändrar färgning av bilden som grund till effekten genom att använda kanalmicern. Du vill säkert senare gå tillbaka till detta för att finjustera färgning av det slutliga resultatet.

source: We use splittoning for add some more coloring to the result for cyan/blue shadows and yellow highlight.
sv: Vi använder färgdelning för att betoning av färgning av resultatet, turkos/blå för skuggor och gul för högdagrar.

source: Use the balance slider to tune the splittoning effect due this differs on every image due to it's exposure, motive etc.
sv: Använd balans reglaget för att finjustera den delade färgtoneffekten då detta skilljer sig från bild till bild.

source: Cyan is a nice color touchup for black and white images, this example guides you thru how to make this with Darktable and how to control the tone. You can choose any tone of your like for this tutorial...
sv: Turkos är en snygg färgton för svartvita bilder, detta exempel guidar dig genom hur du kan skapa denna effekt med Darktable samt hur du kan kontrollera färgtonen. Du kan välja vilken färgton du vill för detta exempel.

source: Prepare the image for the cross process steps by adjusting the base settings such as exposure,black level, contrast etc. for a correctly looking image.
sv: Förbered bilden genom att justera grund inställningar som exponering, svärta, kontrast etc. för att ha ett bra material att fortsätta med.

source: Use the balance slider to tune the effect, out example uses a balance of 70/30
sv: Använd balans inställningen för att finjustera effekten, vårt exempel använder en balans av 70/30.
